Repository: houaria617/auto_manager
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

# appName
source: Auto Manager
ar: مدير السيارات

source: Coming Soon
ar: قريباً

source: Logout
ar: خروج

source: Cancel
ar: إلغاء

source: Add
ar: إضافة

source: Save
ar: حفظ

source: Confirm
ar: تأكيد

source: Error
ar: خطأ

source: Required
ar: مطلوب

# loginTitle
source: Login
ar: تسجيل الدخول

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

# loginButton
source: Sign In
ar: دخول

# navDashboard
source: Dashboard
ar: الرئيسية

# navRentals
source: Rentals
ar: تأجير

# navCars
source: Cars
ar: سيارات

# navClients
source: Clients
ar: عملاء

# navAnalytics
source: Analytics
ar: تحليلات

# settingsTitle
source: Settings
ar: الإعدادات

# agencyInfo
source: Agency Information
ar: معلومات الوكالة

# agencyInfoSubtitle
source: Update agency details.
ar: تحديث المعلومات.

source: App Language
ar: اللغة

# appLanguageSubtitle
source: Select preferred language.
ar: تغيير اللغة.

source: Subscription
ar: الاشتراك

# subscriptionPlan
source: Current Plan: Free
ar: الخطة الحالية: مجانية

# rentalsTitle
source: Rentals
ar: التأجيرات

# tabOngoing
source: Ongoing
ar: جاري

# tabCompleted
source: Completed
ar: مكتمل

# noRentalsOngoing
source: No ongoing rentals
ar: لا يوجد تأجير جاري

# noRentalsCompleted
source: No completed rentals
ar: لا يوجد تأجير مكتمل

source: New Rental
ar: تأجير جديد

source: Rental Details
ar: التفاصيل

source: Renew Rental
ar: تجديد

source: Return Car
ar: إرجاع

source: Manage Payments
ar: المدفوعات

# viewPaymentHistory
source: Payment History
ar: السجل

source: Rental Summary
ar: ملخص

source: Rental Period
ar: المدة

source: days left
ar: أيام متبقية

source: days overdue
ar: أيام تأخير

# addRentalTitle
source: New Rental
ar: إضافة تأجير

source: Select Client
ar: اختر عميل

source: Select Car
ar: اختر سيارة

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ النهاية

source: Total Price
ar: الإجمالي

source: Save Rental
ar: حفظ التأجير

# paymentsTitle
source: Payments
ar: المدفوعات

source: Remaining Balance
ar: المبلغ المتبقي

source: Total Paid
ar: المدفوع

source: Balance Due
ar: المستحق

source: Add Payment
ar: إضافة دفعة

source: Enter Amount
ar: أدخل المبلغ

source: Pay
ar: دفع

# paymentHistory
source: Transaction History
ar: سجل المعاملات

# analyticsTitle
source: Reports & Analytics
ar: التقارير

source: Total Revenue
ar: الإيرادات

source: Total Rentals
ar: عدد التأجيرات

source: Avg. Duration
ar: متوسط المدة

# topCars
source: Top Rented Cars
ar: أفضل السيارات

# clientStats
source: Client Statistics
ar: إحصائيات العملاء

source: Export PDF
ar: تصدير PDF

source: Client
ar: عميل

source: Car
ar: سيارة

source: Select Date
ar: اختر التاريخ

# pleaseSelectDates
source: Please select start and end dates
ar: يرجى اختيار تاريخي البدء والنهاية

# pleaseSelectClient
source: Please select a client
ar: يرجى اختيار عميل

# pleaseSelectCar
source: Please select a car
ar: يرجى اختيار سيارة

source: Please enter price
ar: يرجى إدخال السعر

source: Invalid number
ar: رقم غير صحيح

source: Add New Client
ar: إضافة عميل جديد

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Phone Number
ar: رقم الهاتف

source: Add New Car
ar: إضافة سيارة جديدة

source: Car Name (Model)
ar: اسم السيارة (الموديل)

source: Plate Number
ar: رقم اللوحة

source: Daily Rent Price
ar: سعر الإيجار اليومي

# dateError
source: End date must be after or equal to start date
ar: يجب أن يكون تاريخ النهاية بعد أو يساوي تاريخ البدء

# pricePerDay
source: Price {value}
ar: {price}/يوم

# rentalId
source: Rental ID: {id}
ar: رقم التأجير: {id}

# rentalNoLongerExists
source: This rental no longer exists.
ar: هذا التأجير لم يعد موجوداً.

source: Upgrade to Premium
ar: الترقية إلى المميز

source: Free
ar: مجاني

# zeroDA
source: 0DA
ar: 0 دج

source: Access basic features
ar: الوصول إلى الميزات الأساسية

# limitedRentals
source: Limited rental entries (10 max)
ar: إدخالات تأجير محدودة (10 كحد أقصى)

# limitedCars
source: Limited car entries (10 max)
ar: إدخالات سيارات محدودة (10 كحد أقصى)

source: Premium
ar: مميز

# premiumPrice
source: 5999DA / month
ar: 5999 دج / شهر

source: Access all features
ar: الوصول إلى جميع الميزات

# unlimitedRentals
source: Unlimited rental entries
ar: إدخالات تأجير غير محدودة

# unlimitedCars
source: Unlimited car entries
ar: إدخالات سيارات غير محدودة

source: Rental history & analytics
ar: سجل التأجير والتحليلات

# customReminders
source: Custom reminders for customers
ar: تذكيرات مخصصة للعملاء

source: Recommended
ar: موصى به

source: Return Car (Complete)
ar: إرجاع السيارة (إكمال)

source: Rental Completed
ar: تم إكمال التأجير

# extendRentalDuration
source: Extend the rental duration.
ar: تمديد مدة التأجير.

source: Additional Days
ar: أيام إضافية

source: Days
ar: أيام

source: Estimated Daily Rate:
ar: السعر اليومي المقدر:

source: Extra Cost:
ar: التكلفة الإضافية:

source: Confirm Renew
ar: تأكيد التجديد

# renewedSuccess
source: Renewed for {days} days. Added ${amount} to total.
ar: تم التجديد لمدة {days} أيام. تمت إضافة ${amount} إلى الإجمالي.

# errorRenewing
source: Error renewing rental: {error}
ar: خطأ في تجديد التأجير: {error}

# statusOngoing
source: Ongoing
ar: جاري

# statusCompleted
source: Completed
ar: مكتمل

# statusOverdue
source: OVERDUE
ar: متأخر

# rentalIdLabel
source: Rental ID: {id}
ar: رقم التأجير: {id}

# clientNumber
source: Client #{id}
ar: عميل #{id}

# carNumber
source: Car #{id}
ar: سيارة #{id}

source: View Client
ar: عرض العميل

source: View Car
ar: عرض السيارة

source: No phone info
ar: لا توجد معلومات هاتف

source: Unknown Plate
ar: لوحة غير معروفة

# rentalIdColon
source: Rental ID: {id}
ar: رقم التأجير: {id}

# daysLabel
source: {days} days
ar: {days} أيام

source: Start
ar: البدء

source: End
ar: النهاية

source: Ongoing Rentals
ar: التأجيرات الجارية

source: Available Cars
ar: السيارات المتاحة

source: Due Today
ar: المستحقة اليوم

source: Recent Activities
ar: الأنشطة الأخيرة

# carRentedBy
source: Car {plate} rented by {client}
ar: تم تأجير السيارة {plate} من قبل {client}

source: Revenue
ar: الإيرادات

source: This Week
ar: هذا الأسبوع

source: This Month
ar: هذا الشهر

source: All Time
ar: كل الوقت

source: Custom
ar: مخصص

source: Total Clients
ar: إجمالي العملاء

source: New Clients
ar: عملاء جدد

source: Repeat Clients
ar: عملاء متكررون

# generatingPdf
source: Generating PDF Report...
ar: جارٍ إنشاء تقرير PDF...

# errorGeneratingPdf
source: Error generating PDF: {error}
ar: خطأ في إنشاء PDF: {error}

# pleaseWaitForData
source: Please wait for data to load.
ar: يرجى الانتظار حتى يتم تحميل البيانات.
